backend/app/controllers/api/v1/events_controller.rb

  def show
    event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    loc = Location.new
    loc.lat = event_params[:location][:lat]
    loc.lng = event_params[:location][:lng]
    event = Event.create(time:event_params[:time], location:loc, img:event_params[:img], description:event_params[:description])
---
INSERT INTO "events" ("time", "location", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    Event.find_by(id: params[:id]).destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 5]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]